RDVMI.rdvmi-ext/src/InformationRegisters/рдв_СоответствиеОбъектовИнструкций/рдв_СоответствиеОбъектовИнструкций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рдв_СоответствиеОбъектовИнструкций</name>
  <comment>VELO-1570</comment>
  <resources>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RDVMI.rdvmi-ext/src/CommonModules/рдв_РаботаСИнструкциямиПовтИсп/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьСоответствиеОбъектовМетаданныхИнструкций() Экспорт
	
	// VELO-1570 05.02.2024 pkharchuk@rdv.team
	
	УстановитьПривилегированныйРежим(Истина);
	
	Соответствие = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоответствиеОбъектовИнструкций.ОбъектМетаданных КАК ОбъектМетаданных,
	|	СоответствиеОбъектовИнструкций.Адрес КАК Адрес
	|ИЗ
	|	РегистрСведений.рдв_СоответствиеОбъектовИнструкций КАК СоответствиеОбъектовИнструкций";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.ОбъектМетаданных, Выборка.Адрес);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти
